In [1]:
manager <- c(1,2,3,4,5)

In [2]:
date <- c("10/24/08","10/28/08","10/1/08",
          "10/12/08","5/1/09")

In [3]:
country <- c("US","US","UK","UK","UK")

In [4]:
gender <- c("M", "F", "F", "M", "F") 
age <- c(32, 45, 25, 39, 99) 
q1 <- c(5, 3, 3, 3, 2) 
q2 <- c(4, 5, 5, 3, 2) 
q3 <- c(5, 2, 5, 4, 1) 
q4 <- c(5, 5, 5, NA, 2) 
q5 <- c(5, 5, 2, NA, 1) 
leadership <- data.frame(manager, date, country, gender, age,q1,q2,q3,q4,q5,stringsAsFactors=FALSE)

In [5]:
leadership

  manager date     country gender age q1 q2 q3 q4 q5
1 1       10/24/08 US      M      32  5  4  5   5  5
2 2       10/28/08 US      F      45  3  5  2   5  5
3 3       10/1/08  UK      F      25  3  5  5   5  2
4 4       10/12/08 UK      M      39  3  3  4  NA NA
5 5       5/1/09   UK      F      99  2  2  1   2  1

In [6]:
leadership$age[leadership$age == 99] <- NA

In [7]:
leadership

  manager date     country gender age q1 q2 q3 q4 q5
1 1       10/24/08 US      M      32  5  4  5   5  5
2 2       10/28/08 US      F      45  3  5  2   5  5
3 3       10/1/08  UK      F      25  3  5  5   5  2
4 4       10/12/08 UK      M      39  3  3  4  NA NA
5 5       5/1/09   UK      F      NA  2  2  1   2  1

In [8]:
leadership$agecat[leadership$age  > 75]  <- "Elder" 
leadership$agecat[leadership$age >= 55 & leadership$age <= 75]  <- "Middle Aged" 
leadership$agecat[leadership$age  < 55]  <- "Young"

In [9]:
leadership

  manager date     country gender age q1 q2 q3 q4 q5 agecat
1 1       10/24/08 US      M      32  5  4  5   5  5 Young
2 2       10/28/08 US      F      45  3  5  2   5  5 Young
3 3       10/1/08  UK      F      25  3  5  5   5  2 Young
4 4       10/12/08 UK      M      39  3  3  4  NA NA Young
5 5       5/1/09   UK      F      NA  2  2  1   2  1 NA

In [10]:
names(leadership)

 [1] "manager" "date"    "country" "gender"  "age"     "q1"      "q2"
 [8] "q3"      "q4"      "q5"      "agecat"

In [11]:
installed.packages("plyr")

     Package LibPath Version Priority Depends Imports LinkingTo Suggests
     Enhances License License_is_FOSS License_restricts_use OS_type Archs
     MD5sum NeedsCompilation Built

In [12]:
x <- c(1,2,NA,3)

In [13]:
y <- sum(x,na.rm=TRUE)

In [14]:
y

[1] 6

In [15]:
newDate <- na.omit(leadership)

In [16]:
newDate

  manager date     country gender age q1 q2 q3 q4 q5 agecat
1 1       10/24/08 US      M      32  5  4  5  5  5  Young
2 2       10/28/08 US      F      45  3  5  2  5  5  Young
3 3       10/1/08  UK      F      25  3  5  5  5  2  Young

In [17]:
myDates <- as.Date(c("2007-06-22","2014-02-13"))

In [18]:
myDates

[1] "2007-06-22" "2014-02-13"

In [19]:
myFormat <- "%m/%d/%y"

In [20]:
leadership$date <- as.Date(leadership$date,myFormat)

In [21]:
leadership

  manager date       country gender age q1 q2 q3 q4 q5 agecat
1 1       2008-10-24 US      M      32  5  4  5   5  5 Young
2 2       2008-10-28 US      F      45  3  5  2   5  5 Young
3 3       2008-10-01 UK      F      25  3  5  5   5  2 Young
4 4       2008-10-12 UK      M      39  3  3  4  NA NA Young
5 5       2009-05-01 UK      F      NA  2  2  1   2  1 NA

In [22]:
Sys.Date()

[1] "2018-04-25"

In [23]:
date()

[1] "Wed Apr 25 06:20:39 2018"

In [24]:
orderData <- leadership[order(leadership$age),]

In [25]:
orderData

  manager date       country gender age q1 q2 q3 q4 q5 agecat
3 3       2008-10-01 UK      F      25  3  5  5   5  2 Young
1 1       2008-10-24 US      M      32  5  4  5   5  5 Young
4 4       2008-10-12 UK      M      39  3  3  4  NA NA Young
2 2       2008-10-28 US      F      45  3  5  2   5  5 Young
5 5       2009-05-01 UK      F      NA  2  2  1   2  1 NA

In [28]:
newData <- leadership[,c(6:10)]

In [29]:
newData

  q1 q2 q3 q4 q5
1 5  4  5   5  5
2 3  5  2   5  5
3 3  5  5   5  2
4 3  3  4  NA NA
5 2  2  1   2  1

In [30]:
myVars <- names(leadership) %in% c("q3","q4")

In [31]:
myVars

 [1] FALSE FALSE FALSE FALSE FALSE FALSE FALSE  TRUE  TRUE FALSE FALSE

In [36]:
newData <- leadership[!myVars]

In [37]:
newData

  manager date       country gender age q1 q2 q5 agecat
1 1       2008-10-24 US      M      32  5  4   5 Young
2 2       2008-10-28 US      F      45  3  5   5 Young
3 3       2008-10-01 UK      F      25  3  5   2 Young
4 4       2008-10-12 UK      M      39  3  3  NA Young
5 5       2009-05-01 UK      F      NA  2  2   1 NA

In [38]:
leadership

  manager date       country gender age q1 q2 q3 q4 q5 agecat
1 1       2008-10-24 US      M      32  5  4  5   5  5 Young
2 2       2008-10-28 US      F      45  3  5  2   5  5 Young
3 3       2008-10-01 UK      F      25  3  5  5   5  2 Young
4 4       2008-10-12 UK      M      39  3  3  4  NA NA Young
5 5       2009-05-01 UK      F      NA  2  2  1   2  1 NA

In [39]:
newData <- leadership[1:3,]

In [40]:
newData

  manager date       country gender age q1 q2 q3 q4 q5 agecat
1 1       2008-10-24 US      M      32  5  4  5  5  5  Young
2 2       2008-10-28 US      F      45  3  5  2  5  5  Young
3 3       2008-10-01 UK      F      25  3  5  5  5  2  Young

In [41]:
newData <- leadership[leadership$gender=="M" 
                      & leadership$age >30,]

In [42]:
newData

  manager date       country gender age q1 q2 q3 q4 q5 agecat
1 1       2008-10-24 US      M      32  5  4  5   5  5 Young
4 4       2008-10-12 UK      M      39  3  3  4  NA NA Young

In [43]:
attach(leadership)

The following objects are masked _by_ .GlobalEnv:

    age, country, date, gender, manager, q1, q2, q3, q4, q5

In [44]:
newData <- leadership[gender=="M" & age>30,]

In [45]:
detach(leadership)

In [46]:
newData

  manager date       country gender age q1 q2 q3 q4 q5 agecat
1 1       2008-10-24 US      M      32  5  4  5   5  5 Young
4 4       2008-10-12 UK      M      39  3  3  4  NA NA Young

In [48]:
leadership$date <- as.Date(leadership$date,"%m/%d/%y")

In [49]:
leadership$date

[1] "2008-10-24" "2008-10-28" "2008-10-01" "2008-10-12" "2009-05-01"

In [50]:
startDate <- as.Date("2009-01-01")

In [51]:
endDate <- as.Date("2009-10-31")

In [54]:
newData <- leadership[leadership$date >= startDate &
                            leadership$date <= endDate,]

In [55]:
newData

  manager date       country gender age q1 q2 q3 q4 q5 agecat
5 5       2009-05-01 UK      F      NA  2  2  1  2  1  NA

In [56]:
newData <- subset(leadership,age>=35|age<24,
                  select=c(q1,q2,q3,q4))

In [57]:
newData

  q1 q2 q3 q4
2 3  5  2   5
4 3  3  4  NA

In [58]:
help(subset)